import csv
data= ['ปลอด', 'ภัย', 'patongjugceylone', 'กระท่อม', 'หลาย', 'แห่ง', 'บน', 'ชาย', 'หาด', 'กลับ', 'มา', 'นั่ง', 'พักผ่อน', 'และ', 'ดู', 
'โลก', 'ไป', 'ตาม', 'ที่', 'คุณเพลิดเพลิน', 'กับ', 'เครื่อง', 'ดื่ม', 'จาก', 'บาร์', 'ที่', 'มี', 'ให้', 'เลือก', 'มากมาย', 'และ', 'หลากหลาย', 'ที่', 'เสิร์ฟ', 'โดย', 'พนักงาน', 'ที่', 'มี', 'คุณภาพ', 'กล้วย', 'ชนิด', 'ลอย', 'อยู่', 'ใน', 'น้ำ', 'และ', 'อื่น',\
     'กว่า', 'คุณ', 'ผ่อนคลาย', 'ใน', 'ยาม', 'บ่าย', 'กษัตริย์', 'แห่ง', 'โซวินี', 'ทั้งหมด', 'สวม', 'ใส่', 'ว่าย', 'น้ำ', 'กะตะมาก',\
          'ขึ้น', 'กับ', 'ความ', 'ชอบ', 'ของ', 'เรา', 'กะ', 'ตะน้อย', 'ซึ่ง', 'เป็น', 'ที่', 'ชื่นชอบ', 'โดย', 'รวม', 'ของ', 'เรา', 'กับ', 'ใน', \
              'หาน', 'ที่', 'สอง', 'ใกล้', 'กับ', 'ผู้คน', 'จาก', 'ทั่ว', 'ทุก', 'มุม', 'โลก', 'กับ', 'ผู้', 'ชาย', 'คน', 'หนึ่ง', 'และ', 'เขา', 'กลับ', 'มา', 'พร้อม', 'กับ', 'การ', 'กระจัดกระจาย', 'ครั้ง', 'ใหญ่', 'เกิด', 'ขึ้น', 'จาก', 'ธุรกิจ', 'เตียง', 'อาบ', 'แดด', 'ที่',
 'ไม่', 'มี', 'ใบ', 'อนุญาต', 'และ', 'ทำ', 'ให้', 'พื้นที่', 'น่า', 'สนใจ', 'ยิ่ง', 'ขึ้น', 'การ', 'จราจร', 'ค่อนข้าง', 'วุ่นวาย', 
'ใน', 'บริเวณ', 'โดย', 'รอบ', 'การ', 'ช็อปปิ้ง', 'ก็', 'ดี', 'เช่น', 'กัน', 'บาร์', 'ส่วน', 'ใหญ่', 'มี', 'ผู้', 'หญิง', 'ที่', 'เล่น', 'เกม', 'กับ', 'คุณ', 'การ', 'ดู', 'คาราโอเกะ', 'นั้น', 'ใน', 'บาง', 'สถานที่', 'เฮฮา', 'การ', 'ตัดสินใจ', 'ที่', 'ดี', 'ที่สุด', 'ที่', 'เคย', 'ทำ', 'การ', 'ตั้ง', 'ค่า', 'ที่', 'ดี', 'ที่สุด', 'ใน', 'ป่า', 'ตอง', 'การ', 'ต่อรอง', 'ราคา', 'นั้น', 'สนุก', 'และ', 'ฉัน', 'เริ่มต้น', 'ที่', 'ประมาณ', 'การ', 'นวด', 'แผน', 'ไทย', 'จำนวน', 'มาก', 'เกิด', 'ขึ้น']
def readcsv():
 with open(f'./testCode/csv/stopword.csv', encoding="utf8") as csvfile:
    readers = csv.reader(csvfile)
    lambdas=[]
    next(readers, None)
    for row in readers:
     words=row[0]
     replaceWord = words.replace("\\u200b","").replace("\\n","").replace("-ADJ","").replace("-ADV","")
     lambdas.append(replaceWord)
    return lambdas
stopword = readcsv()
test = list(set(data) - set(stopword))

print(test)